{
  "sortnum": 2,
  "name": "Задания горничной",
  "icon": "touhou_little_maid:garage_kit{ModelId:'touhou_little_maid:daiyousei'}",
  "category": "maid",
  "pages": [
    {
      "type": "text",
      "text": "Когда вы открываете интерфейс горничной, вы можете увидеть список на левой стороне. Это панель заданий. Соответствующие функции являются следующими:$(li)Ожидание: задача по умолчанию; горничная ничего не делает.$(li)Атака: если вы положите меч на главную руку горничной, поведение горничной будет таким же, как ванильный волк, активно атакующий враждебных существ."
    },
    {
      "type": "text",
      "text": "$(li)Лук: если вы поместите лук на главную руку горничной, и поместите стрелы в другие блоки инвентаря, они будут активно атаковать враждебных существ стреляя из луков.$(li)Данмаку: если вы положите гохей в главную руку горничной, она будет стрелять данмаку для атаки враждебных существ, и запускать различные числа данмаку в зависимости от количества враждебных существ вокруг нее."
    },
    {
      "type": "text",
      "text": "$(li)Ферма: если вы дадите семена горничной, она будет активно сажать урожай вокруг нее и собирать их. Только когда горничная имеет мотыгу в руке, она может ломать урожай подобно игроку.$(li)Сахарный тростник: сажает и собирает сахарные тростники.$(li)Арбуз: собирает арбузы и тыквы.$(li)Какао: сажает и собирает какао.$(li)Трава: ломает траву и цветы вокруг горничной."
    },
    {
      "type": "text",
      "text": "$(li)Снег: очищает слои снега вокруг нее, снежки выпадают, если она держит лопату.$(li)Кормление: если вы поместите еду в инвентарь в горничной, она будет активно кормить игрока, когда голод игрока будет низким.$(li)Стричь: если вы поместите ножницы в главную руку горничной, она будет активно стричь овец вокруг нее.$(li)Факел: если вы дадите факела горничной, она будет активно помещать факелы, в области с низкой яркостью."
    },
    {
      "type": "text",
      "text": "$(li)Выращивание: если вы поместите предметы, необходимые для размножения животных, в инвентарь горничной, она начинает активно кормить окружающих животных.$(li)Огнетушение: основная рука горницы должна держать огнетушитель. Когда этот режим включен, горничная будет тушить горящего владельца и компаньонов в пределах 3 блоков."
    },
    {
      "type": "text",
      "text": "$(li)Сломать: необходимо использовать вместе с руководством по уничтожению. Сначала используйте руководство по уничтожению, чтобы отметить блок, который будет уничтожен, затем поместите его в левую руку горничной и наконец поместите кирку в правую руку горничной. Она может уничтожать помеченные блоки.$(li)Печь: должна быть использована вместе с руководством по плавке."
    },
    {
      "type": "text",
      "text": "Сначала откройте интерфейс руководства печи, чтобы отметить нужное топливо и предметы, затем поместите его в правую руку горничной. Она будет искать окружающие печи для использования.$(li)Зельеварение: необходимо использовать вместе с руководством по зелью. Сначала откройте интерфейс руководства по зелью, чтобы отметить рецепт зелья, затем поместите его в основную руку горницы. Горничная найдет зельеварочные стойки во круге."
    }
  ]
}